#!/usr/bin/env python
# -*- coding: utf-8 -*-
# Date   : 2017/12/26 10:27
# Author : lixingyun

uids = [str(i) for i in range(5524, 5624)]

# for uid in uids:
#     Common.set_money(uid,999999,999999)
#     Common.set_xd(uid, 999999)
# exit()
# 用例ID,{用户:下注选项,结果1,2,loss,dog时的预期}
gamble_case_lists = [
    # 当选项1有下注,2无下注,单
    ('1', {
        uids[0]: {'1': 100, 'ret': [0, -100, 0]}
    }),
    # 当选项1有下注,2无下注,多
    ('2', {
        uids[0]: {'1': 100, 'ret': [0, -100, 0]},
        uids[1]: {'1': 100, 'ret': [0, -100, 0]}
    }),
    # 当选项2有下注,1无下注,单
    ('3', {
        uids[0]: {'2': 100, 'ret': [-100, 0, 0]}
    }),
    # 当选项2有下注,1无下注,多
    ('4', {
        uids[0]: {'2': 100, 'ret': [-100, 0, 0]},
        uids[1]: {'2': 100, 'ret': [-100, 0, 0]}
    }),
    # 当选项12都有下注,两个用户,1:1,1:1
    ('5', {
        uids[0]: {'1': 1, 'ret': [0, -1, 0]},
        uids[1]: {'2': 1, 'ret': [-1, 0, 0]}
    }),
    # 当选项12都有下注,两个用户,1:1,1:10
    ('6', {
        uids[0]: {'1': 1, 'ret': [9, -1, 0]},
        uids[1]: {'2': 10, 'ret': [-10, 0, 0]}
    }),
    # 当选项12都有下注,两个用户,1:1,2:100
    ('7', {
        uids[0]: {'1': 1, 'ret': [95, -1, 0]},
        uids[1]: {'2': 100, 'ret': [-100, 0, 0]}
    }),
    # 当选项12都有下注,两个用户,1:10,2:100
    ('8', {
        uids[0]: {'1': 10, 'ret': [95, -10, 0]},
        uids[1]: {'2': 100, 'ret': [-100, 9, 0]}
    }),
    # 当选项12都有下注,两个用户,1:1000,2:1000
    ('9', {
        uids[0]: {'1': 1000, 'ret': [950, -1000, 0]},
        uids[1]: {'2': 1000, 'ret': [-1000, 950, 0]}
    }),
    # 当选项12都有下注,多个用户,A1:1,A2:1,B1:1,B2:1
    ('10', {
        uids[0]: {'1': 1, 'ret': [0, -1, 0]},
        uids[1]: {'1': 1, 'ret': [0, -1, 0]},
        uids[2]: {'2': 1, 'ret': [-1, 0, 0]},
        uids[3]: {'2': 1, 'ret': [-1, 0, 0]}
    }),
    # 当选项AB都有下注,多个用户,A1:1,A2:1,B1:10,B2:10
    ('11', {
        uids[0]: {'1': 1, 'ret': [9, -1, 0]},
        uids[1]: {'1': 1, 'ret': [9, -1, 0]},
        uids[2]: {'2': 10, 'ret': [-10, 0, 0]},
        uids[3]: {'2': 10, 'ret': [-10, 0, 0]}
    }),
    # 当选项AB都有下注,多个用户,A1:1,A2:1,B1:100,B2:100
    ('12', {
        uids[0]: {'1': 1, 'ret': [95, -1, 0]},
        uids[1]: {'1': 1, 'ret': [95, -1, 0]},
        uids[2]: {'2': 100, 'ret': [-100, 0, 0]},
        uids[3]: {'2': 100, 'ret': [-100, 0, 0]}
    }),
    # 当选项AB都有下注,多个用户,A1:10,A2:20,B1:100,B2:300
    ('13', {
        uids[0]: {'1': 10, 'ret': [126, -10, 0]},
        uids[1]: {'1': 20, 'ret': [253, -20, 0]},
        uids[2]: {'2': 100, 'ret': [-100, 7, 0]},
        uids[3]: {'2': 300, 'ret': [-300, 21, 0]}
    }),
]
# 用例ID,{用户:banker(选项,下注,赔率)坐庄buyer(选项,下注额,实际额)下注,ret:1,2,loss/dog时的预期}
banker_case_lists = [
    # 结算A
    ## 有坐庄无下注时
    # 1.当选项A有坐庄,无下注,选项B无坐庄,无下注
    ('1', {
        uids[0]: {'banker': {'2': [100, 2]}, 'ret': [0, 0, 0]},
    }),
    # 当选项A有多个坐庄,无下注,选项B无坐庄,无下注
    ('2', {
        uids[0]: {'banker': {'2': [100, 2]}, 'ret': [0, 0, 0]},
        uids[1]: {'banker': {'2': [100, 2]}, 'ret': [0, 0, 0]},
    }),
    # 当选项A无坐庄,无下注,选项B有坐庄,无下注
    ('3', {
        uids[0]: {'banker': {'1': [100, 2]}, 'ret': [0, 0, 0]},
    }),
    # 当选项A无坐庄,无下注,选项B有多个坐庄,无下注
    ('4', {
        uids[0]: {'banker': {'1': [100, 2]}, 'ret': [0, 0, 0]},
        uids[1]: {'banker': {'1': [100, 2]}, 'ret': [0, 0, 0]},
    }),
    # 当选项A,B都有庄,无下注
    ('5', {
        uids[0]: {'banker': {'1': [100, 2], '2': [100, 2]}, 'ret': [0, 0, 0]},
        uids[1]: {'banker': {'1': [100, 2], '2': [100, 2]}, 'ret': [0, 0, 0]},
    }),
    ## 有坐庄有下注 - 单边有坐庄下注
    # 6.当选项A有一个坐庄,有一个下注,选项B无坐庄,无下注
    (
        {'uid': uids[0], 'banker': {'1': [100, 10.9]}, 'ret': [-99, 9, 0]},
        {'uid': uids[1], 'buyer': {'1': 10}, 'ret': [94, -10, 0]},
    ),
    # 当选项A有一个坐庄,有多个下注(未买完),选项B无坐庄,无下注
    ('7', {
        uids[0]: {'banker': {'2': [100, 0.5]}, 'ret': [-75, 142, 0]},
        uids[1]: {'buyer': {'1': 100}, 'ret': [47, -100, 0]},
        uids[2]: {'buyer': {'1': 50}, 'ret': [23, -50, 0]},
    }),
    # 当选项A有一个坐庄,有多个下注(超庄),选项B无坐庄,无下注
    ('8', {
        uids[0]: {'banker': {'2': [100, 0.5]}, 'ret': [-100, 190, 0]},
        uids[1]: {'buyer': {'1': 100}, 'ret': [47, -100, 0]},
        uids[2]: {'buyer': {'1': [200, 100]}, 'ret': [47, -100, 0]},
    }),
    # 当选项A有多个坐庄(同用户,同赔率),有一个下注(跨庄),选项B无坐庄,无下注
    ('9', {
        uids[0]: {'banker': [{'2': [100, 0.5]}, {'2': [100, 0.5]}], 'ret': [-200, 380, 0]},
        uids[1]: {'buyer': {'1': 400}, 'ret': [190, -400, 0]},
    }),
    # 当选项A有多个坐庄(不同用户,同赔率),有一个下注(跨庄),选项B无坐庄,无下注
    ('10', {
        uids[0]: {'banker': {'2': [100, 0.5]}, 'ret': [-100, 190, 0]},
        uids[1]: {'banker': {'2': [100, 0.5]}, 'buyer': {'1': 400}, 'ret': [90, -210, 0]},
    }),
    # 当选项A有多个坐庄(不同用户,不同赔率),有一个下注(超庄),选项B无坐庄,无下注
    ('11', {
        uids[0]: {'banker': {'2': [100, 0.5]}, 'ret': [0, 0, 0]},
        uids[1]: {'banker': {'2': [100, 0.6]}, 'ret': [-100, 157, 0]},
        uids[2]: {'buyer': {'1': [170, 166]}, 'ret': [94, -166, 0]},
    }),
    # 当选项A有多个坐庄,多个下注,选项B无坐庄,无下注
    ('12', {
        uids[0]: {'banker': {'2': [100, 0.5]}, 'ret': [-50, 95, 0]},
        uids[1]: {'banker': {'2': [100, 0.6]}, 'ret': [-100, 157, 0]},
        uids[2]: {'buyer': {'1': 100}, 'ret': [57, -100, 0]},
        uids[3]: {'buyer': {'1': [100, 66]}, 'ret': [37, -66, 0]},
        uids[4]: {'buyer': {'1': 100}, 'ret': [47, -100, 0]},
    }),
    # 当选项A无坐庄,无下注,选项B有一个坐庄,有一个下注
    ('13', {
        uids[0]: {'banker': {'1': [100, 0.5]}, 'ret': [-100, 190, 0]},
        uids[1]: {'buyer': {'2': 200}, 'ret': [95, -200, 0]},
    }),
    # 当选项A无坐庄,无下注,选项B有一个坐庄,有多个下注(未买完)
    ('14', {
        uids[0]: {'banker': {'1': [100, 0.5]}, 'ret': [142, -75, 0]},
        uids[1]: {'buyer': {'2': 100}, 'ret': [-100, 47, 0]},
        uids[2]: {'buyer': {'2': 50}, 'ret': [-50, 23, 0]},
    }),

    # 当选项A无坐庄,无下注,选项B有一个坐庄,有多个下注(超庄)
    ('15', {
        uids[0]: {'banker': {'1': [100, 0.5]}, 'ret': [190, -100, 0]},
        uids[1]: {'buyer': {'2': 100}, 'ret': [-100, 47, 0]},
        uids[2]: {'buyer': {'2': [200, 100]}, 'ret': [-100, 47, 0]},
    }),
    # 当选项A无坐庄,无下注,选项B有多个坐庄(同用户,同赔率),有一个下注(跨庄)
    ('16', {
        uids[0]: {'banker': [{'1': [100, 0.5]}, {'1': [100, 0.5]}], 'ret': [380, -200, 0]},
        uids[1]: {'buyer': {'2': 400}, 'ret': [-400, 190, 0]},
    }),
    # 当选项A无坐庄,无下注,选项B有多个坐庄(不同用户,同赔率),有一个下注(跨庄)
    ('17', {
        uids[0]: {'banker': {'1': [100, 0.5]}, 'ret': [190, -100, 0]},
        uids[1]: {'banker': {'1': [100, 0.5]}, 'buyer': {'2': 400}, 'ret': [-210, 90, 0]},
    }),
    # 当选项A无坐庄,无下注,有一个下注(超庄),选项B有多个坐庄(不同用户,不同赔率)
    ('18', {
        uids[0]: {'banker': {'1': [100, 0.5]}, 'ret': [0, 0, 0]},
        uids[1]: {'banker': {'1': [100, 0.6]}, 'ret': [157, -100, 0]},
        uids[2]: {'buyer': {'2': [170, 166]}, 'ret': [-166, 94, 0]},
    }),
    # 当选项A无坐庄,无下注,选项B有多个坐庄,多个下注
    ('19', {
        uids[0]: {'banker': {'1': [100, 9.9]}, 'ret': [9, -99, 0]},
        uids[1]: {'banker': {'1': [100, 0.6]}, 'ret': [157, -100, 0]},
        uids[2]: {'buyer': {'2': 10}, 'ret': [-10, 94, 0]},
        uids[3]: {'buyer': {'2': 100}, 'ret': [-100, 57, 0]},
        uids[4]: {'buyer': {'2': [100, 66]}, 'ret': [-66, 37, 0]},
    }),
    ## 有坐庄有下注 - 两边有坐庄下注
    ('20', {
        uids[0]: {'banker': {'1': [100, 9.9]}, 'ret': [9, -99, 0]},
        uids[1]: {'banker': {'1': [100, 5]}, 'ret': [19, -100, 0]},
        uids[2]: {'banker': {'1': [100, 0.5]}, 'ret': [190, -100, 0]},
        uids[3]: {'buyer': {'1': [20, 10]}, 'ret': [94, -10, 0]},
        uids[4]: {'buyer': {'1': 10}, 'ret': [47, -10, 0]},
        uids[5]: {'buyer': {'1': [100, 10]}, 'ret': [47, -10, 0]},
        uids[6]: {'buyer': {'1': 200}, 'ret': [95, -200, 0]},
        uids[7]: {'banker': {'2': [100, 9.9]}, 'ret': [-99, 9, 0]},
        uids[8]: {'banker': {'2': [100, 5]}, 'ret': [-100, 19, 0]},
        uids[9]: {'banker': {'2': [100, 0.5]}, 'ret': [-100, 190, 0]},
        uids[10]: {'buyer': {'2': [11, 10]}, 'ret': [-10, 94, 0]},
        uids[11]: {'buyer': {'2': 10}, 'ret': [-10, 47, 0]},
        uids[12]: {'buyer': {'2': [100, 10]}, 'ret': [-10, 47, 0]},
        uids[13]: {'buyer': {'2': 200}, 'ret': [-200, 95, 0]},
    }),

]
