#!/usr/bin/env python
# -*- coding: utf-8 -*-
# Date   : 2017/12/26 10:27
# Author : lixingyun

uids = [str(i) for i in range(5524, 5624)]

# for uid in uids:
#     Common.set_money(uid,999999,999999)
#     Common.set_xd(uid, 999999)
# exit()
# 参数表示猫豆和仙豆同时下的金额,预期收益,option_AB表示两个选项的下注,
gamble_case_lists_A = [
    # 当选项1有下注,2无下注,单
    # ('A1', {'1': {uids[0]: (100, 0)}, '2': None}),
    ('A1', {uids[0]:{'1':100,'ret':0}}),
    # 当选项A有下注,B无下注,多
    ('A2', {'option_A': {uids[0]: (100, 0), uids[1]: (100, 0)}, 'option_B': None}),
    # 当选项B有下注,A无下注,单
    ('A3', {'option_A': None, 'option_B': {uids[0]: (100, -100)}}),
    # 当选项B有下注,A无下注,多
    ('A4', {'option_A': None, 'option_B': {uids[0]: (100, -100), uids[1]: (100, -100)}}),
    # 当选项AB都有下注,两个用户,A:1,B:1
    ('A5', {'option_A': {uids[0]: (1, 0)}, 'option_B': {uids[1]: (1, -1)}}),
    # 当选项AB都有下注,两个用户,A:1,B:10
    ('A6', {'option_A': {uids[0]: (1, 9)}, 'option_B': {uids[1]: (10, -10)}}),
    # 当选项AB都有下注,两个用户,A:1,B:100
    ('A7', {'option_A': {uids[0]: (1, 95)}, 'option_B': {uids[1]: (100, -100)}}),
    # 当选项AB都有下注,两个用户,A:10,B:100
    ('A8', {'option_A': {uids[0]: (10, 95)}, 'option_B': {uids[1]: (100, -100)}}),
    # 当选项AB都有下注,两个用户,A:1000,B:1000
    ('A9', {'option_A': {uids[0]: (1000, 950)}, 'option_B': {uids[1]: (1000, -1000)}}),
    # 当选项AB都有下注,多个用户,A1:1,A2:1,B1:1,B2:1
    ('A10', {'option_A': {uids[0]: (1, 0), uids[1]: (1, 0)}, 'option_B': {'5526': (1, -1), '5527': (1, -1)}}),
    # 当选项AB都有下注,多个用户,A1:1,A2:1,B1:10,B2:10
    ('A11', {'option_A': {uids[0]: (1, 9), uids[1]: (1, 9)}, 'option_B': {'5526': (10, -10), '5527': (10, -10)}}),
    # 当选项AB都有下注,多个用户,A1:1,A2:1,B1:100,B2:100
    ('A12', {'option_A': {uids[0]: (1, 95), uids[1]: (1, 95)}, 'option_B': {'5526': (100, -100), '5527': (100, -100)}}),
    # 当选项AB都有下注,多个用户,A1:10,A2:20,B1:100,B2:300
    ('A13', {'option_A': {uids[0]: (10, 126), uids[1]: (20, 253)}, 'option_B': {'5526': (100, -100), '5527': (300, -300)}}), ]
gamble_case_lists_B = [
    # 当选项A有下注,B无下注,单
    ('B1', {'option_A': {uids[0]: (100, -100)}, 'option_B': None}),
    # 当选项A有下注,B无下注,多
    ('B2', {'option_A': {uids[0]: (100, -100), uids[1]: (100, -100)}, 'option_B': None}),
    # 当选项B有下注,A无下注,单
    ('B3', {'option_A': None, 'option_B': {uids[0]: (100, 0)}}),
    # 当选项B有下注,A无下注,多
    ('B4', {'option_A': None, 'option_B': {uids[0]: (100, 0), uids[1]: (100, 0)}}),
    # 当选项AB都有下注,两个用户,A:1,B:1
    ('B5', {'option_A': {uids[0]: (1, -1)}, 'option_B': {uids[1]: (1, 0)}}),
    # 当选项AB都有下注,两个用户,A:1,B:10
    ('B6', {'option_A': {uids[0]: (1, -1)}, 'option_B': {uids[1]: (10, 0)}}),
    # 当选项AB都有下注,两个用户,A:1,B:100
    ('B7', {'option_A': {uids[0]: (1, -1)}, 'option_B': {uids[1]: (100, 0)}}),
    # 当选项AB都有下注,两个用户,A:10,B:100
    ('B8', {'option_A': {uids[0]: (10, -10)}, 'option_B': {uids[1]: (100, 9)}}),
    # 当选项AB都有下注,两个用户,A:1000,B:1000
    ('B9', {'option_A': {uids[0]: (1000, -1000)}, 'option_B': {uids[1]: (1000, 950)}}),
    # 当选项AB都有下注,多个用户,A1:1,A2:1,B1:1,B2:1
    ('B10', {'option_A': {uids[0]: (1, -1), uids[1]: (1, -1)}, 'option_B': {'5526': (1, 0), '5527': (1, 0)}}),
    # 当选项AB都有下注,多个用户,A1:1,A2:1,B1:10,B2:10
    ('B11', {'option_A': {uids[0]: (1, -1), uids[1]: (1, -1)}, 'option_B': {'5526': (10, 0), '5527': (10, 0)}}),
    # 当选项AB都有下注,多个用户,A1:1,A2:1,B1:100,B2:100
    ('B12', {'option_A': {uids[0]: (1, -1), uids[1]: (1, -1)}, 'option_B': {'5526': (100, 0), '5527': (100, 0)}}),
    # 当选项AB都有下注,多个用户,A1:10,A2:20,B1:100,B2:300
    ('B13', {'option_A': {uids[0]: (10, -10), uids[1]: (20, -20)}, 'option_B': {'5526': (100, 7), '5527': (300, 21)}}), ]
gamble_case_lists_L = [
    # 结算:流局
    # 当选项A有下注,B无下注,单
    ('L1', {'option_A': {uids[0]: (100, 0)}, 'option_B': None}),
    # 当选项A有下注,B无下注,多
    ('L2', {'option_A': {uids[0]: (100, 0), uids[1]: (100, 0)}, 'option_B': None}),
    # 当选项B有下注,A无下注,单
    ('L3', {'option_A': None, 'option_B': {uids[0]: (100, 0)}}),
    # 当选项B有下注,A无下注,多
    ('L4', {'option_A': None, 'option_B': {uids[0]: (100, 0), uids[1]: (100, 0)}}),
    # 当选项AB都有下注,两个用户,A:1,B:1
    ('L5', {'option_A': {uids[0]: (1, 0)}, 'option_B': {uids[1]: (1, 0)}}),
    # 当选项AB都有下注,两个用户,A:1,B:10
    ('L6', {'option_A': {uids[0]: (1, 0)}, 'option_B': {uids[1]: (10, 0)}}),
    # 当选项AB都有下注,两个用户,A:1,B:100
    ('L7', {'option_A': {uids[0]: (1, 0)}, 'option_B': {uids[1]: (100, 0)}}),
    # 当选项AB都有下注,两个用户,A:10,B:100
    ('L8', {'option_A': {uids[0]: (10, 0)}, 'option_B': {uids[1]: (100, 0)}}),
    # 当选项AB都有下注,两个用户,A:1000,B:1000
    ('L9', {'option_A': {uids[0]: (1000, 0)}, 'option_B': {uids[1]: (1000, 0)}}),
    # 当选项AB都有下注,多个用户,A1:1,A2:1,B1:1,B2:1
    ('L10', {'option_A': {uids[0]: (1, 0), uids[1]: (1, 0)}, 'option_B': {'5526': (1, 0), '5527': (1, 0)}}),
    # 当选项AB都有下注,多个用户,A1:1,A2:1,B1:10,B2:10
    ('L11', {'option_A': {uids[0]: (1, 0), uids[1]: (1, 0)}, 'option_B': {'5526': (10, 0), '5527': (10, 0)}}),
    # 当选项AB都有下注,多个用户,A1:1,A2:1,B1:100,B2:100
    ('L12', {'option_A': {uids[0]: (1, 0), uids[1]: (1, 0)}, 'option_B': {'5526': (100, 0), '5527': (100, 0)}}),
    # 当选项AB都有下注,多个用户,A1:10,A2:20,B1:100,B2:300
    ('L13', {'option_A': {uids[0]: (10, 0), uids[1]: (20, 0)}, 'option_B': {'5526': (100, 0), '5527': (300, 0)}}), ]
gamble_case_lists_D = [
    # 当选项A有下注,B无下注,单
    ('D1', {'option_A': {uids[0]: (100, 0)}, 'option_B': None}),
    # 当选项A有下注,B无下注,多
    ('D2', {'option_A': {uids[0]: (100, 0), uids[1]: (100, 0)}, 'option_B': None}),
    # 当选项B有下注,A无下注,单
    ('D3', {'option_A': None, 'option_B': {uids[0]: (100, 0)}}),
    # 当选项B有下注,A无下注,多
    ('D4', {'option_A': None, 'option_B': {uids[0]: (100, 0), uids[1]: (100, 0)}}),
    # 当选项AB都有下注,两个用户,A:1,B:1
    ('D5', {'option_A': {uids[0]: (1, 0)}, 'option_B': {uids[1]: (1, 0)}}),
    # 当选项AB都有下注,两个用户,A:1,B:10
    ('D6', {'option_A': {uids[0]: (1, 0)}, 'option_B': {uids[1]: (10, 0)}}),
    # 当选项AB都有下注,两个用户,A:1,B:100
    ('D7', {'option_A': {uids[0]: (1, 0)}, 'option_B': {uids[1]: (100, 0)}}),
    # 当选项AB都有下注,两个用户,A:10,B:100
    ('D8', {'option_A': {uids[0]: (10, 0)}, 'option_B': {uids[1]: (100, 0)}}),
    # 当选项AB都有下注,两个用户,A:1000,B:1000
    ('D9', {'option_A': {uids[0]: (1000, 0)}, 'option_B': {uids[1]: (1000, 0)}}),
    # 当选项AB都有下注,多个用户,A1:1,A2:1,B1:1,B2:1
    ('D10', {'option_A': {uids[0]: (1, 0), uids[1]: (1, 0)}, 'option_B': {'5526': (1, 0), '5527': (1, 0)}}),
    # 当选项AB都有下注,多个用户,A1:1,A2:1,B1:10,B2:10
    ('D11', {'option_A': {uids[0]: (1, 0), uids[1]: (1, 0)}, 'option_B': {'5526': (10, 0), '5527': (10, 0)}}),
    # 当选项AB都有下注,多个用户,A1:1,A2:1,B1:100,B2:100
    ('D12', {'option_A': {uids[0]: (1, 0), uids[1]: (1, 0)}, 'option_B': {'5526': (100, 0), '5527': (100, 0)}}),
    # 当选项AB都有下注,多个用户,A1:10,A2:20,B1:100,B2:300
    ('D13', {'option_A': {uids[0]: (10, 0), uids[1]: (20, 0)}, 'option_B': {'5526': (100, 0), '5527': (300, 0)}}), ]
# 参数表示猫豆和仙豆同时(下注金额,预期收益,赔率),(下注金额,预期收益,实际下注金额)option_AB表示两个选项的下注buyer坐庄banker,
banker_case_lists_A = [
    # 结算A
    ## 有坐庄无下注时
    # 当选项A有坐庄,无下注,选项B无坐庄,无下注
    ('A1', {'option_A': None,
            'option_B': {'banker': [{uids[0]: (100, 0, 1)}]}, }),
    # 当选项A有多个坐庄,无下注,选项B无坐庄,无下注
    ('A2', {'option_A': None,
            'option_B': {'banker': [{uids[0]: (100, 0, 1)}, {uids[1]: (100, 0, 1)}]}, }),
    # 当选项A无坐庄,无下注,选项B有坐庄,无下注
    ('A3', {'option_A': {'banker': [{uids[0]: (100, 0, 1)}]},
            'option_B': None},),
    # 当选项A无坐庄,无下注,选项B有多个坐庄,无下注
    ('A4', {'option_A': {'banker': [{uids[0]: (100, 0, 1)}, {uids[1]: (100, 0, 1)}]},
            'option_B': None}),
    # 当选项A,B都有庄,无下注
    ('A5', {'option_A': {'banker': [{uids[0]: (100, 0, 1)}, {uids[1]: (100, 0, 1)}]},
            'option_B': {'banker': [{uids[0]: (100, 0, 1)}, {uids[1]: (100, 0, 1)}]}, }),
    ## 有坐庄有下注 - 单边有坐庄下注
    # 当选项A有一个坐庄,有一个下注,选项B无坐庄,无下注
    ('A6', {'option_A': {'buyer': [{uids[1]: (10, 94)}]},
            'option_B': {'banker': [{uids[0]: (100, -99, 9.9)}]}, },),
    # 当选项A有一个坐庄,有多个下注(未买完),选项B无坐庄,无下注
    ('A7', {'option_A': {'buyer': [{uids[1]: (100, 47)}, {uids[2]: (50, 23)}]},
            'option_B': {'banker': [{uids[0]: (100, -75, 0.5)}]}, },),
    # 当选项A有一个坐庄,有多个下注(超庄),选项B无坐庄,无下注
    ('A8', {'option_A': {'buyer': [{uids[1]: (100, 47)}, {uids[2]: (200, 47, 100)}]},
            'option_B': {'banker': [{uids[0]: (100, -100, 0.5)}]}, },),
    # 当选项A有多个坐庄(同用户,同赔率),有一个下注(跨庄),选项B无坐庄,无下注
    ('A9', {'option_A': {'buyer': [{uids[1]: (400, 190)}]},
            'option_B': {'banker': [{uids[0]: (100, -200, 0.5)}, {uids[0]: (100, -200, 0.5)}]}, }),
    # 当选项A有多个坐庄(不同用户,同赔率),有一个下注(跨庄),选项B无坐庄,无下注
    ('A10', {'option_A': {'buyer': [{uids[1]: (400, 90)}]},
             'option_B': {'banker': [{uids[0]: (100, -100, 0.5)}, {uids[1]: (100, 90, 0.5)}]}, }),
    # 当选项A有多个坐庄(不同用户,不同赔率),有一个下注(超庄),选项B无坐庄,无下注
    ('A11', {'option_A': {'buyer': [{uids[1]: (170, 94, 166)}]},
             'option_B': {'banker': [{uids[0]: (100, 0, 0.5)}, {uids[2]: (100, -100, 0.6)}]}, }),
    # 当选项A有多个坐庄,多个下注,选项B无坐庄,无下注
    ('A12', {'option_A': {'buyer': [{uids[0]: (100, 57)}, {uids[1]: (100, 37, 66)}, {uids[2]: (100, 47)}]},
             'option_B': {'banker': [{uids[3]: (100, -50, 0.5)}, {uids[4]: (100, -100, 0.6)}]}, }),
    # 当选项A无坐庄,无下注,选项B有一个坐庄,有一个下注
    ('A13', {'option_A': {'banker': [{uids[0]: (100, 190, 0.5)}]},
             'option_B': {'buyer': [{uids[1]: (200, -200)}]}, }),
    # 当选项A无坐庄,无下注,选项B有一个坐庄,有多个下注(未买完)
    ('A14', {'option_A': {'banker': [{uids[0]: (100, 142, 0.5)}]},
             'option_B': {'buyer': [{uids[1]: (100, -100)}, {uids[2]: (50, -50)}]}, }),
    # 当选项A无坐庄,无下注,选项B有一个坐庄,有多个下注(超庄)
    ('A15', {'option_A': {'banker': [{uids[0]: (100, 190, 0.5)}]},
             'option_B': {'buyer': [{uids[1]: (100, -100)}, {uids[2]: (200, -100, 100)}]}, }),
    # 当选项A无坐庄,无下注,选项B有多个坐庄(同用户,同赔率),有一个下注(跨庄)
    ('A16', {'option_A': {'banker': [{uids[0]: (100, 380, 0.5)}, {uids[0]: (100, 380, 0.5)}]},
             'option_B': {'buyer': [{uids[1]: (400, -400)}]}, }),
    # 当选项A无坐庄,无下注,选项B有多个坐庄(不同用户,同赔率),有一个下注(跨庄)
    ('A17', {'option_A': {'banker': [{uids[0]: (100, 190, 0.5)}, {uids[1]: (100, -210, 0.5)}]},
             'option_B': {'buyer': [{uids[1]: (400, -210)}]}, }),
    # 当选项A无坐庄,无下注,有一个下注(超庄),选项B有多个坐庄(不同用户,不同赔率)
    ('A18', {'option_A': {'banker': [{uids[0]: (100, 0, 0.5)}, {uids[2]: (100, 157, 0.6)}]},
             'option_B': {'buyer': [{uids[1]: (170, -166, 166)}]}, }),
    # 当选项A无坐庄,无下注,选项B有多个坐庄,多个下注
    ('A19', {'option_A': {'banker': [{uids[3]: (100, 9, 9.9)}, {uids[4]: (100, 157, 0.6)}]},
             'option_B': {'buyer': [{uids[0]: (10, -10)}, {uids[1]: (100, -100)}, {uids[2]: (100, -66, 66)}]}, }),
    ## 有坐庄有下注 - 两边有坐庄下注
    ('A20', {'option_A': {'banker': [{uids[0]: (100, 9, 9.9)}, {uids[1]: (100, 19, 5)}, {uids[2]: (100, 190, 0.5)}],
                          'buyer': [{uids[3]: (20, 94, 10)}, {uids[4]: (10, 47)}, {uids[5]: (100, 47, 10)}, {uids[6]: (200, 95)}]},
             'option_B': {'banker': [{uids[7]: (100, -99, 9.9)}, {uids[8]: (100, -100, 5)}, {uids[9]: (100, -100, 0.5)}],
                          'buyer': [{uids[10]: (10, -10, 10)}, {uids[11]: (10, -10)}, {uids[12]: (100, -10, 10)}, {uids[13]: (200, -200)}]}, }),
]
banker_case_lists_B = [
    # 结算B
    ## 有坐庄无下注时
    # 当选项A有坐庄,无下注,选项B无坐庄,无下注
    ('B1', {'option_A': None,
            'option_B': {'banker': [{uids[0]: (100, 0, 1)}]}, }),
    # 当选项A有多个坐庄,无下注,选项B无坐庄,无下注
    ('B2', {'option_A': None,
            'option_B': {'banker': [{uids[0]: (100, 0, 1)}, {uids[1]: (100, 0, 1)}]}, }),
    # 当选项A无坐庄,无下注,选项B有坐庄,无下注
    ('B3', {'option_A': {'banker': [{uids[0]: (100, 0, 1)}]},
            'option_B': None},),
    # 当选项A无坐庄,无下注,选项B有多个坐庄,无下注
    ('B4', {'option_A': {'banker': [{uids[0]: (100, 0, 1)}, {uids[1]: (100, 0, 1)}]},
            'option_B': None}),
    # 当选项A,B都有庄,无下注
    ('B5', {'option_A': {'banker': [{uids[0]: (100, 0, 1)}, {uids[1]: (100, 0, 1)}]},
            'option_B': {'banker': [{uids[0]: (100, 0, 1)}, {uids[1]: (100, 0, 1)}]}, }),
    ## 有坐庄有下注 - 单边有坐庄下注
    # 当选项A有一个坐庄,有一个下注,选项B无坐庄,无下注
    ('B6', {'option_A': {'buyer': [{uids[1]: (10, -10)}]},
            'option_B': {'banker': [{uids[0]: (100, 9, 9.9)}]}, },),
    # 当选项A有一个坐庄,有多个下注(未买完),选项B无坐庄,无下注
    ('B7', {'option_A': {'buyer': [{uids[1]: (100, -100)}, {uids[2]: (50, -50)}]},
            'option_B': {'banker': [{uids[0]: (100, 142, 0.5)}]}, },),
    # 当选项A有一个坐庄,有多个下注(超庄),选项B无坐庄,无下注
    ('B8', {'option_A': {'buyer': [{uids[1]: (100, -100)}, {uids[2]: (200, -100, 100)}]},
            'option_B': {'banker': [{uids[0]: (100, 190, 0.5)}]}, },),
    # 当选项A有多个坐庄(同用户,同赔率),有一个下注(跨庄),选项B无坐庄,无下注
    ('B9', {'option_A': {'buyer': [{uids[1]: (400, -400)}]},
            'option_B': {'banker': [{uids[0]: (100, 380, 0.5)}, {uids[0]: (100, 380, 0.5)}]}, }),
    # 当选项A有多个坐庄(不同用户,同赔率),有一个下注(跨庄),选项B无坐庄,无下注
    ('B10', {'option_A': {'buyer': [{uids[1]: (400, -210)}]},
             'option_B': {'banker': [{uids[0]: (100, 190, 0.5)}, {uids[1]: (100, -210, 0.5)}]}, }),
    # 当选项A有多个坐庄(不同用户,不同赔率),有一个下注(超庄),选项B无坐庄,无下注
    ('B11', {'option_A': {'buyer': [{uids[1]: (170, -166, 166)}]},
             'option_B': {'banker': [{uids[0]: (100, 0, 0.5)}, {uids[2]: (100, 157, 0.6)}]}, }),
    # 当选项A有多个坐庄,多个下注,选项B无坐庄,无下注
    ('B12', {'option_A': {'buyer': [{uids[0]: (100, -100)}, {uids[1]: (100, -66, 66)}, {uids[2]: (100, -100)}]},
             'option_B': {'banker': [{uids[3]: (100, 95, 0.5)}, {uids[4]: (100, 157, 0.6)}]}, }),
    # 当选项A无坐庄,无下注,选项B有一个坐庄,有一个下注
    ('B13', {'option_A': {'banker': [{uids[0]: (100, -100, 0.5)}]},
             'option_B': {'buyer': [{uids[1]: (200, 95)}]}, }),
    # 当选项A无坐庄,无下注,选项B有一个坐庄,有多个下注(未买完)
    ('B14', {'option_A': {'banker': [{uids[0]: (100, -75, 0.5)}]},
             'option_B': {'buyer': [{uids[1]: (100, 47)}, {uids[2]: (50, 23)}]}, }),
    # 当选项A无坐庄,无下注,选项B有一个坐庄,有多个下注(超庄)
    ('B15', {'option_A': {'banker': [{uids[0]: (100, -100, 0.5)}]},
             'option_B': {'buyer': [{uids[1]: (100, 47)}, {uids[2]: (200, 47, 100)}]}, }),
    # 当选项A无坐庄,无下注,选项B有多个坐庄(同用户,同赔率),有一个下注(跨庄)
    ('B16', {'option_A': {'banker': [{uids[0]: (100, -200, 0.5)}, {uids[0]: (100, -200, 0.5)}]},
             'option_B': {'buyer': [{uids[1]: (400, 190)}]}, }),
    # 当选项A无坐庄,无下注,选项B有多个坐庄(不同用户,同赔率),有一个下注(跨庄)
    ('B17', {'option_A': {'banker': [{uids[0]: (100, -100, 0.5)}, {uids[1]: (100, 90, 0.5)}]},
             'option_B': {'buyer': [{uids[1]: (400, 90)}]}, }),
    # 当选项A无坐庄,无下注,有一个下注(超庄),选项B有多个坐庄(不同用户,不同赔率)
    ('B18', {'option_A': {'banker': [{uids[0]: (100, 0, 0.5)}, {uids[2]: (100, -100, 0.6)}]},
             'option_B': {'buyer': [{uids[1]: (170, 94, 166)}]}, }),
    # 当选项A无坐庄,无下注,选项B有多个坐庄,多个下注
    ('B19', {'option_A': {'banker': [{uids[3]: (100, -99, 9.9)}, {uids[4]: (100, -100, 0.6)}]},
             'option_B': {'buyer': [{uids[0]: (10, 94)}, {uids[1]: (100, 57)}, {uids[2]: (100, 37, 66)}]}, }),
    ## 有坐庄有下注 - 两边有坐庄下注
    ('B20', {'option_A': {'banker': [{uids[0]: (100, -99, 9.9)}, {uids[1]: (100, -100, 5)}, {uids[2]: (100, -100, 0.5)}],
                          'buyer': [{uids[3]: (20, -10, 10)}, {uids[4]: (10, -10)}, {uids[5]: (100, -10, 10)}, {uids[6]: (200, -200)}]},
             'option_B': {'banker': [{uids[7]: (100, 9, 9.9)}, {uids[8]: (100, 19, 5)}, {uids[9]: (100, 190, 0.5)}],
                          'buyer': [{uids[10]: (11, 94, 10)}, {uids[11]: (10, 47)}, {uids[12]: (100, 47, 10)}, {uids[13]: (200, 95)}]}, }),
]
banker_case_lists_L = [
    # 流局
    ## 有坐庄无下注时
    # 当选项A有坐庄,无下注,选项B无坐庄,无下注
    ('L1', {'option_A': None,
            'option_B': {'banker': [{uids[0]: (100, 0, 1)}]}, }),
    # 当选项A有多个坐庄,无下注,选项B无坐庄,无下注
    ('L2', {'option_A': None,
            'option_B': {'banker': [{uids[0]: (100, 0, 1)}, {uids[1]: (100, 0, 1)}]}, }),
    # 当选项A无坐庄,无下注,选项B有坐庄,无下注
    ('L3', {'option_A': {'banker': [{uids[0]: (100, 0, 1)}]},
            'option_B': None},),
    # 当选项A无坐庄,无下注,选项B有多个坐庄,无下注
    ('L4', {'option_A': {'banker': [{uids[0]: (100, 0, 1)}, {uids[1]: (100, 0, 1)}]},
            'option_B': None}),
    # 当选项A,B都有庄,无下注
    ('L5', {'option_A': {'banker': [{uids[0]: (100, 0, 1)}, {uids[1]: (100, 0, 1)}]},
            'option_B': {'banker': [{uids[0]: (100, 0, 1)}, {uids[1]: (100, 0, 1)}]}, }),
    ## 有坐庄有下注 - 单边有坐庄下注
    # 当选项A有一个坐庄,有一个下注,选项B无坐庄,无下注
    ('L6', {'option_A': {'buyer': [{uids[1]: (10, 0)}]},
            'option_B': {'banker': [{uids[0]: (100, 0, 9.9)}]}, },),
    # 当选项A有一个坐庄,有多个下注(未买完),选项B无坐庄,无下注
    ('L7', {'option_A': {'buyer': [{uids[1]: (100, 0)}, {uids[2]: (50, 0)}]},
            'option_B': {'banker': [{uids[0]: (100, 0, 0.5)}]}, },),
    # 当选项A有一个坐庄,有多个下注(超庄),选项B无坐庄,无下注
    ('L8', {'option_A': {'buyer': [{uids[1]: (100, 0)}, {uids[2]: (200, 0, 100)}]},
            'option_B': {'banker': [{uids[0]: (100, 0, 0.5)}]}, },),
    # 当选项A有多个坐庄(同用户,同赔率),有一个下注(跨庄),选项B无坐庄,无下注
    ('L9', {'option_A': {'buyer': [{uids[1]: (400, 0)}]},
            'option_B': {'banker': [{uids[0]: (100, 0, 0.5)}, {uids[0]: (100, 0, 0.5)}]}, }),
    # 当选项A有多个坐庄(不同用户,同赔率),有一个下注(跨庄),选项B无坐庄,无下注
    ('L10', {'option_A': {'buyer': [{uids[1]: (400, 0)}]},
             'option_B': {'banker': [{uids[0]: (100, 0, 0.5)}, {uids[1]: (100, 0, 0.5)}]}, }),
    # 当选项A有多个坐庄(不同用户,不同赔率),有一个下注(超庄),选项B无坐庄,无下注
    ('L11', {'option_A': {'buyer': [{uids[1]: (170, 0, 166)}]},
             'option_B': {'banker': [{uids[0]: (100, 0, 0.5)}, {uids[2]: (100, 0, 0.6)}]}, }),
    # 当选项A有多个坐庄,多个下注,选项B无坐庄,无下注
    ('L12', {'option_A': {'buyer': [{uids[0]: (100, 0)}, {uids[1]: (100, 0, 66)}, {uids[2]: (100, 0)}]},
             'option_B': {'banker': [{uids[3]: (100, 0, 0.5)}, {uids[4]: (100, 0, 0.6)}]}, }),
    # 当选项A无坐庄,无下注,选项B有一个坐庄,有一个下注
    ('L13', {'option_A': {'banker': [{uids[0]: (100, 0, 0.5)}]},
             'option_B': {'buyer': [{uids[1]: (200, 0)}]}, }),
    # 当选项A无坐庄,无下注,选项B有一个坐庄,有多个下注(未买完)
    ('L14', {'option_A': {'banker': [{uids[0]: (100, 0, 0.5)}]},
             'option_B': {'buyer': [{uids[1]: (100, 0)}, {uids[2]: (50, 0)}]}, }),
    # 当选项A无坐庄,无下注,选项B有一个坐庄,有多个下注(超庄)
    ('L15', {'option_A': {'banker': [{uids[0]: (100, 0, 0.5)}]},
             'option_B': {'buyer': [{uids[1]: (100, 0)}, {uids[2]: (200, 0, 100)}]}, }),
    # 当选项A无坐庄,无下注,选项B有多个坐庄(同用户,同赔率),有一个下注(跨庄)
    ('L16', {'option_A': {'banker': [{uids[0]: (100, 0, 0.5)}, {uids[0]: (100, 0, 0.5)}]},
             'option_B': {'buyer': [{uids[1]: (400, 0)}]}, }),
    # 当选项A无坐庄,无下注,选项B有多个坐庄(不同用户,同赔率),有一个下注(跨庄)
    ('L17', {'option_A': {'banker': [{uids[0]: (100, 0, 0.5)}, {uids[1]: (100, 0, 0.5)}]},
             'option_B': {'buyer': [{uids[1]: (400, 0)}]}, }),
    # 当选项A无坐庄,无下注,有一个下注(超庄),选项B有多个坐庄(不同用户,不同赔率)
    ('L18', {'option_A': {'banker': [{uids[0]: (100, 0, 0.5)}, {uids[2]: (100, 0, 0.6)}]},
             'option_B': {'buyer': [{uids[1]: (170, 0, 166)}]}, }),
    # 当选项A无坐庄,无下注,选项B有多个坐庄,多个下注
    ('L19', {'option_A': {'banker': [{uids[3]: (100, 0, 9.9)}, {uids[4]: (100, 0, 0.6)}]},
             'option_B': {'buyer': [{uids[0]: (10, 0)}, {uids[1]: (100, 0)}, {uids[2]: (100, 0, 66)}]}, }),
    ## 有坐庄有下注 - 两边有坐庄下注
    ('L20', {'option_A': {'banker': [{uids[0]: (100, 0, 9.9)}, {uids[1]: (100, 0, 5)}, {uids[2]: (100, 0, 0.5)}],
                          'buyer': [{uids[3]: (20, 0, 10)}, {uids[4]: (10, 0)}, {uids[5]: (100, 0, 10)}, {uids[6]: (200, 0)}]},
             'option_B': {'banker': [{uids[7]: (100, 0, 9.9)}, {uids[8]: (100, 0, 5)}, {uids[9]: (100, 0, 0.5)}],
                          'buyer': [{uids[10]: (11, 0, 10)}, {uids[11]: (10, 0)}, {uids[12]: (100, 0, 10)}, {uids[13]: (200, 0)}]}, }),
]
banker_case_lists_D = [
    # 流局
    ## 有坐庄无下注时
    # 当选项A有坐庄,无下注,选项B无坐庄,无下注
    ('D1', {'option_A': None,
            'option_B': {'banker': [{uids[0]: (100, 0, 1)}]}, }),
    # 当选项A有多个坐庄,无下注,选项B无坐庄,无下注
    ('D2', {'option_A': None,
            'option_B': {'banker': [{uids[0]: (100, 0, 1)}, {uids[1]: (100, 0, 1)}]}, }),
    # 当选项A无坐庄,无下注,选项B有坐庄,无下注
    ('D3', {'option_A': {'banker': [{uids[0]: (100, 0, 1)}]},
            'option_B': None},),
    # 当选项A无坐庄,无下注,选项B有多个坐庄,无下注
    ('D4', {'option_A': {'banker': [{uids[0]: (100, 0, 1)}, {uids[1]: (100, 0, 1)}]},
            'option_B': None}),
    # 当选项A,B都有庄,无下注
    ('D5', {'option_A': {'banker': [{uids[0]: (100, 0, 1)}, {uids[1]: (100, 0, 1)}]},
            'option_B': {'banker': [{uids[0]: (100, 0, 1)}, {uids[1]: (100, 0, 1)}]}, }),
    ## 有坐庄有下注 - 单边有坐庄下注
    # 当选项A有一个坐庄,有一个下注,选项B无坐庄,无下注
    ('D6', {'option_A': {'buyer': [{uids[1]: (10, 0)}]},
            'option_B': {'banker': [{uids[0]: (100, 0, 9.9)}]}, },),
    # 当选项A有一个坐庄,有多个下注(未买完),选项B无坐庄,无下注
    ('D7', {'option_A': {'buyer': [{uids[1]: (100, 0)}, {uids[2]: (50, 0)}]},
            'option_B': {'banker': [{uids[0]: (100, 0, 0.5)}]}, },),
    # 当选项A有一个坐庄,有多个下注(超庄),选项B无坐庄,无下注
    ('D8', {'option_A': {'buyer': [{uids[1]: (100, 0)}, {uids[2]: (200, 0, 100)}]},
            'option_B': {'banker': [{uids[0]: (100, 0, 0.5)}]}, },),
    # 当选项A有多个坐庄(同用户,同赔率),有一个下注(跨庄),选项B无坐庄,无下注
    ('D9', {'option_A': {'buyer': [{uids[1]: (400, 0)}]},
            'option_B': {'banker': [{uids[0]: (100, 0, 0.5)}, {uids[0]: (100, 0, 0.5)}]}, }),
    # 当选项A有多个坐庄(不同用户,同赔率),有一个下注(跨庄),选项B无坐庄,无下注
    ('D10', {'option_A': {'buyer': [{uids[1]: (400, 0)}]},
             'option_B': {'banker': [{uids[0]: (100, 0, 0.5)}, {uids[1]: (100, 0, 0.5)}]}, }),
    # 当选项A有多个坐庄(不同用户,不同赔率),有一个下注(超庄),选项B无坐庄,无下注
    ('D11', {'option_A': {'buyer': [{uids[1]: (170, 0, 166)}]},
             'option_B': {'banker': [{uids[0]: (100, 0, 0.5)}, {uids[2]: (100, 0, 0.6)}]}, }),
    # 当选项A有多个坐庄,多个下注,选项B无坐庄,无下注
    ('D12', {'option_A': {'buyer': [{uids[0]: (100, 0)}, {uids[1]: (100, 0, 66)}, {uids[2]: (100, 0)}]},
             'option_B': {'banker': [{uids[3]: (100, 0, 0.5)}, {uids[4]: (100, 0, 0.6)}]}, }),
    # 当选项A无坐庄,无下注,选项B有一个坐庄,有一个下注
    ('D13', {'option_A': {'banker': [{uids[0]: (100, 0, 0.5)}]},
             'option_B': {'buyer': [{uids[1]: (200, 0)}]}, }),
    # 当选项A无坐庄,无下注,选项B有一个坐庄,有多个下注(未买完)
    ('D14', {'option_A': {'banker': [{uids[0]: (100, 0, 0.5)}]},
             'option_B': {'buyer': [{uids[1]: (100, 0)}, {uids[2]: (50, 0)}]}, }),
    # 当选项A无坐庄,无下注,选项B有一个坐庄,有多个下注(超庄)
    ('D15', {'option_A': {'banker': [{uids[0]: (100, 0, 0.5)}]},
             'option_B': {'buyer': [{uids[1]: (100, 0)}, {uids[2]: (200, 0, 100)}]}, }),
    # 当选项A无坐庄,无下注,选项B有多个坐庄(同用户,同赔率),有一个下注(跨庄)
    ('D16', {'option_A': {'banker': [{uids[0]: (100, 0, 0.5)}, {uids[0]: (100, 0, 0.5)}]},
             'option_B': {'buyer': [{uids[1]: (400, 0)}]}, }),
    # 当选项A无坐庄,无下注,选项B有多个坐庄(不同用户,同赔率),有一个下注(跨庄)
    ('D17', {'option_A': {'banker': [{uids[0]: (100, 0, 0.5)}, {uids[1]: (100, 0, 0.5)}]},
             'option_B': {'buyer': [{uids[1]: (400, 0)}]}, }),
    # 当选项A无坐庄,无下注,有一个下注(超庄),选项B有多个坐庄(不同用户,不同赔率)
    ('D18', {'option_A': {'banker': [{uids[0]: (100, 0, 0.5)}, {uids[2]: (100, 0, 0.6)}]},
             'option_B': {'buyer': [{uids[1]: (170, 0, 166)}]}, }),
    # 当选项A无坐庄,无下注,选项B有多个坐庄,多个下注
    ('D19', {'option_A': {'banker': [{uids[3]: (100, 0, 9.9)}, {uids[4]: (100, 0, 0.6)}]},
             'option_B': {'buyer': [{uids[0]: (10, 0)}, {uids[1]: (100, 0)}, {uids[2]: (100, 0, 66)}]}, }),
    ## 有坐庄有下注 - 两边有坐庄下注
    ('D20', {'option_A': {'banker': [{uids[0]: (100, 0, 9.9)}, {uids[1]: (100, 0, 5)}, {uids[2]: (100, 0, 0.5)}],
                          'buyer': [{uids[3]: (20, 0, 10)}, {uids[4]: (10, 0)}, {uids[5]: (100, 0, 10)}, {uids[6]: (200, 0)}]},
             'option_B': {'banker': [{uids[7]: (100, 0, 9.9)}, {uids[8]: (100, 0, 5)}, {uids[9]: (100, 0, 0.5)}],
                          'buyer': [{uids[10]: (11, 0, 10)}, {uids[11]: (10, 0)}, {uids[12]: (100, 0, 10)}, {uids[13]: (200, 0)}]}, }),
]

banker_case_lists = banker_case_lists_A + banker_case_lists_B + banker_case_lists_L + banker_case_lists_D
gamble_case_lists = gamble_case_lists_A + gamble_case_lists_B + gamble_case_lists_L + gamble_case_lists_D
